#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_lightsail_static_ip.amplifica: Refreshing state... [id=amplifica]
aws_ssm_document.cloud_init_wait: Refreshing state... [id=cloud-init-wait]
cloudflare_record.amplifica: Refreshing state... [id=ad60a43465cd244eafc054a81299b3b1]
aws_lightsail_instance.amplifica: Refreshing state... [id=amplifica_server]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lightsail_instance.amplifica is tainted, so must be replaced
-/+ resource "aws_lightsail_instance" "amplifica" {
      ~ arn                = "arn:aws:lightsail:us-east-2:762560579492:Instance/5dd167e6-e65a-4211-a925-50090bc00ae4" -> (known after apply)
      ~ cpu_count          = 1 -> (known after apply)
      ~ created_at         = "2022-02-02T01:51:05Z" -> (known after apply)
      ~ id                 = "amplifica_server" -> (known after apply)
      ~ ipv6_address       = "2600:1f16:9c6:bb00:61e4:4aea:5318:7756" -> (known after apply)
      ~ ipv6_addresses     = [
          - "2600:1f16:9c6:bb00:61e4:4aea:5318:7756",
        ] -> (known after apply)
      ~ is_static_ip       = false -> (known after apply)
      - key_pair_name      = "LightsailDefaultKeyPair" -> null
        name               = "amplifica_server"
      ~ private_ip_address = "172.26.3.138" -> (known after apply)
      ~ public_ip_address  = "18.118.254.216" -> (known after apply)
      ~ ram_size           = 1 -> (known after apply)
        tags               = {
            "project" = "amplifica"
        }
      ~ username           = "ubuntu" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_lightsail_instance_public_ports.amplifica will be created
  + resource "aws_lightsail_instance_public_ports" "amplifica" {
      + id            = (known after apply)
      + instance_name = "amplifica_server"

      + port_info {
          + cidrs     = (known after apply)
          + from_port = 22
          + protocol  = "tcp"
          + to_port   = 22
        }
      + port_info {
          + cidrs     = (known after apply)
          + from_port = 3838
          + protocol  = "tcp"
          + to_port   = 3838
        }
      + port_info {
          + cidrs     = (known after apply)
          + from_port = 443
          + protocol  = "tcp"
          + to_port   = 443
        }
      + port_info {
          + cidrs     = (known after apply)
          + from_port = 8787
          + protocol  = "tcp"
          + to_port   = 8787
        }
    }

  # aws_lightsail_static_ip_attachment.amplifica will be created
  + resource "aws_lightsail_static_ip_attachment" "amplifica" {
      + id             = (known after apply)
      + instance_name  = (known after apply)
      + ip_address     = (known after apply)
      + static_ip_name = "amplifica"
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @diraol, Action: `pull_request`*